{
  "projects": [
    {
      "id": "bathroom-renovation-stanmore",
      "title": "Full Bathroom Renovation",
      "category": "Bathrooms",
      "location": "Stanmore",
      "description": "Complete bathroom transformation with walk-in shower, 3D feature tiles, and ambient LED lighting.",
      "fullDescription": "A dated bathroom converted into a modern, spa-inspired space. We removed the old bathtub and installed a spacious frameless glass walk-in shower with 3D wave pattern feature tiles. The room features vertical blue LED ambient lighting, a wall-hung toilet with concealed cistern, and a floating vanity unit. Finished with a chrome heated towel rail, recessed spotlights, and dark gray floor tiles throughout.",
      "completedDate": "Jan 2023",
      "images": [
        "/images/projects/bathroom_before_after_2_hq.png",
        "/images/projects/20260105_160553.jpg",
        "/images/projects/bathroom_before_after_hq.png",
        "/images/projects/20260105_160558.jpg"
      ]
    },
    {
      "id": "restaurant-fitout-kenton",
      "title": "Restaurant Interior Renovation and Fit-Out",
      "category": "Commercial",
      "location": "Kenton",
      "description": "Full interior renovation featuring gold mosaic counter, herringbone flooring, and decorating.",
      "fullDescription": "Complete interior fit-out for a restaurant in Kenton. We built a custom service counter clad in gold hexagonal mosaic tiles with a white worktop. Laid herringbone flooring throughout the space. Painted walls and ceiling, and installed all lighting including wall sconces, pendant chandelier, and ring ceiling light. A warm, inviting space ready for customers.",
      "completedDate": "November 2025",
      "images": [
        "/images/projects/img-20251115-wa0001-1-picsart-aiimageenhancer.jpg",
        "/images/projects/img-20251115-wa0005-1-picsart-aiimageenhancer.jpg",
        "/images/projects/img-20251115-wa0000-1-picsart-aiimageenhancer.jpg"
      ]
    },
    {
      "id": "loft-bathroom-barnet",
      "title": "Loft Bathroom",
      "category": "Bathrooms",
      "location": "Barnet",
      "description": "Loft bathroom with marble-effect tiling, walk-in shower, underfloor heating, and skylight.",
      "fullDescription": "New bathroom fitted in a loft space in Barnet. We tiled the floor and walls with marble-effect porcelain tiles, working around the sloped ceiling. Installed a walk-in shower enclosure with rainfall showerhead and handheld shower. Fitted a wall-hung toilet with brass flush plate, white vanity unit with basin, and chrome heated towel rail. Built a custom storage cupboard under the eaves. Full plumbing and underfloor heating installation. Natural light from the Velux skylight.",
      "completedDate": "Oct 2025",
      "images": [
        "/images/projects/img-20251115-wa0020-1-picsart-aiimageenhancer.jpg",
        "/images/projects/img-20251115-wa0019-1-picsart-aiimageenhancer.jpg",
        "/images/projects/img-20251115-wa0021-1-picsart-aiimageenhancer.jpg"
      ]
    },
    {
      "fullDescription": "A complete transformation of an outdated kitchen into a stunning modern cooking space. We installed custom-built cabinets, quartz worktops, and integrated appliances. The open-plan design now flows seamlessly into the dining area, creating a perfect space for family gatherings and entertaining.",
      "index": 1,
      "location": "Stanmore",
      "title": "Modern Kitchen Renovation",
      "images": [
        "/images/projects/kitchen-1.jpg",
        "/images/projects/kitchen-3.jpg"
      ],
      "completedDate": "March 2024",
      "id": "modern-kitchen-renovation",
      "description": "Complete kitchen redesign with custom cabinetry and worktops",
      "category": "Kitchens"
    },
    {
      "fullDescription": "This loft conversion added a luxurious master suite to the property, complete with a walk-in wardrobe and en-suite bathroom. We installed Velux skylights to flood the space with natural light, and the dormer extension maximised headroom. Full insulation and underfloor heating ensure year-round comfort.",
      "index": 2,
      "location": "Harrow",
      "title": "Loft Conversion Master Suite",
      "images": [
        "/images/projects/loft-1.jpg",
        "/images/projects/loft-3.jpg"
      ],
      "completedDate": "January 2024",
      "id": "loft-conversion-master-suite",
      "description": "Spacious loft conversion with skylights and en-suite bathroom",
      "category": "Residential"
    },
    {
      "fullDescription": "This rear extension transformed a cramped kitchen into a stunning open-plan living space. Bi-fold doors open onto the garden, blurring the line between indoor and outdoor living. The extension includes a contemporary kitchen, dining area, and family room, with skylights providing abundant natural light throughout.",
      "index": 4,
      "location": "Wembley",
      "title": "Rear House Extension",
      "images": [
        "/images/projects/residential-1.jpg",
        "/images/projects/residential-2.jpg"
      ],
      "completedDate": "December 2023",
      "id": "rear-house-extension",
      "description": "Open-plan living extension with bi-fold doors",
      "category": "Extensions"
    },
    {
      "fullDescription": "A complete commercial fit-out for a growing business, featuring open-plan workspaces, private meeting rooms with glass partitions, and a welcoming reception area. We installed suspended ceilings, LED lighting, and a modern HVAC system. The design promotes collaboration while providing quiet spaces for focused work.",
      "index": 5,
      "location": "Stanmore",
      "title": "Office Fit-out",
      "images": [
        "/images/projects/commercial-1.jpg",
        "/images/projects/commercial-2.jpg"
      ],
      "completedDate": "November 2023",
      "id": "office-fit-out",
      "description": "Modern open-plan office space with glass partitions",
      "category": "Commercial"
    },
    {
      "fullDescription": "By building out into the side return, we created a significantly larger kitchen and dining space. A large rooflight runs the length of the extension, flooding the room with natural light. The result is a bright, airy kitchen that has become the heart of the family home.",
      "index": 7,
      "location": "Northwood",
      "title": "Side Return Extension",
      "images": [
        "/images/projects/residential-2.jpg",
        "/images/projects/residential-1.jpg"
      ],
      "completedDate": "September 2023",
      "id": "side-return-extension",
      "description": "Kitchen extension maximising natural light",
      "category": "Extensions"
    }
  ]
}
