{
  "testimonials": [
    {
      "name": "Sarah Mitchell",
      "location": "Stanmore",
      "project": "Kitchen Renovation",
      "text": "Excellent work on our kitchen renovation. The team was professional, clean, and tidy throughout the entire process. They kept us informed at every stage and the final result exceeded our expectations. Highly recommend Alpha Global Builders!",
      "rating": 5,
      "featured": true
    },
    {
      "name": "David Richardson",
      "location": "Harrow",
      "project": "Loft Conversion",
      "text": "Alpha Global completed our loft conversion on time and within budget. Outstanding quality throughout. The attention to detail was impressive and they managed all the planning permissions for us. Our new master suite is absolutely stunning.",
      "rating": 5,
      "featured": true
    },
    {
      "name": "Emma Thompson",
      "location": "Wembley",
      "project": "House Extension",
      "text": "Fantastic experience from start to finish. They explained every step clearly and were always available to answer questions. Very happy with our new extension - it's transformed how we use our home.",
      "rating": 5,
      "featured": true
    },
    {
      "name": "James Patterson",
      "location": "Edgware",
      "project": "Bathroom Renovation",
      "text": "We hired Alpha Global for two bathroom renovations. Both completed to an excellent standard. The team was respectful of our home and cleaned up daily. Would definitely use again and have recommended to friends.",
      "rating": 5,
      "featured": true
    },
    {
      "name": "Lisa Chen",
      "location": "Pinner",
      "project": "Full House Renovation",
      "text": "Complete renovation of our 1930s semi. The project was complex but the team handled everything brilliantly. From structural work to final finishes, the quality has been exceptional. Our home is unrecognisable!",
      "rating": 5,
      "featured": false
    },
    {
      "name": "Michael O'Brien",
      "location": "Northwood",
      "project": "Commercial Fit-out",
      "text": "We engaged Alpha Global for our office fit-out. Professional from the first meeting to handover. They worked around our business hours and delivered a modern, functional space. Great value for money.",
      "rating": 5,
      "featured": false
    },
    {
      "name": "Amanda Hughes",
      "location": "Bushey",
      "project": "Rear Extension",
      "text": "The team added a stunning rear extension to our property. The bi-fold doors and open plan layout have completely changed how we live. Communication was excellent throughout - no surprises on cost or timeline.",
      "rating": 5,
      "featured": false
    },
    {
      "name": "Robert Singh",
      "location": "Barnet",
      "project": "Driveway & Landscaping",
      "text": "New driveway and complete front garden landscaping. The transformation is incredible. Neighbours have commented on how much it's improved the street appeal. Professional team and fair pricing.",
      "rating": 5,
      "featured": false
    },
    {
      "name": "Catherine Williams",
      "location": "Stanmore",
      "project": "Kitchen Extension",
      "text": "Our kitchen extension has given us the family space we always wanted. The project was managed seamlessly and the finish quality is superb. Thank you Alpha Global for making our dream kitchen a reality!",
      "rating": 5,
      "featured": false
    },
    {
      "name": "Tom Baker",
      "location": "Harrow",
      "project": "Electrical Upgrade",
      "text": "Full rewire of our property plus smart home installation. The electricians were knowledgeable and took time to explain the system. Everything works perfectly. Very pleased with the service.",
      "rating": 5,
      "featured": false
    }
  ]
}
